<?php

return [

  'all_permission' => 'អ្នកមានសិទ្ធទាំងអស់',

  'lang' => [
    'english' => 'អង់គ្លេស',
    'khmer' => 'ខ្មែរ',
  ],
  
  
  'title' => [
    'no_permission' => 'ពុំមានសិទ្ធិ',
    'disabled_action' => 'សកម្មភាពពុំដំណើរការ!',
  ],
  
  'text' => [
    'no_permission' => 'អ្នកពុំមានសិទ្ធិដើម្បីធ្វើសកម្មភាពនេះទេ សូមទាក់ទងអ្នកគ្រប់គ្រង!',
    'disabled_form' => 'មិនអាចបញ្ចូលទិន្នន័យបានក្រោយពេលដាក់ស្នើសុំឡើយ!',
  ],

  'crud' => [
    'success' => [
      'update_order' => 'លំដាប់រៀងត្រូវបានកែប្រែដោយជោគជ័យ',
      'create' => 'ទិនន្ន័យត្រូវបានបង្កើតថ្មីដោយជោគជ័យ ',
      'update' => 'ទិនន្ន័យត្រូវបានកែប្រែដោយជោគជ័យ ',
      'delete' => 'ទិនន្ន័យត្រូវបានលុបចោលដោយជោគជ័យ ',
      'remove' => 'ទិនន្ន័យត្រូវបានដកចេញដោយជោគជ័យ ',
      'submit' => 'ទន្នន័យត្រូវបានស្នើសុំដោយជោគជ័យ',
    ],

    'error' => [
      'update_order' => 'លំដាប់រៀងត្រូវបានកែប្រែដោយជោគជ័យ',
      'create' => 'ទិនន្ន័យត្រូវបានបង្កើតថ្មីដោយជោគជ័យ',
      'update' => 'ទិនន្ន័យត្រូវបានកែប្រែដោយជោគជ័យ',
      'delete' => 'ទិនន្ន័យត្រូវបានលុបចោលដោយជោគជ័យ',
      'remove' => 'ទិនន្ន័យត្រូវបានដកចេញដោយជោគជ័យ',
    ],
  ],
  
  
  'swal' => [
    'title' => [
      'status' => 'តើអ្នកចង់ផ្លាស់ប្ដូរស្ថានភាពមែនទេ?',
      'invoice_status' => 'តើអ្នកចង់ផ្លាស់ប្ដូរស្ថានភាពបង់ប្រាក់មែនទេ?',
      'save' => 'រក្សាទុក?',
      'offline' => 'អ្នកនៅក្រៅបណ្ដាញយូរពេក',
      'rate_not_found' => 'អត្រាប្ដូរប្រាក់រកមិនឃើញឡើយ!',
      'empty_field' => 'សូមបញ្ចូលទិន្នន័យជាមុនសិន',
      'exist_field' => 'មានរួចហើយ!',
      'empty' => 'ពុំទាន់មានទិន្នន័យនៅឡើយ',
      'sure' => 'តើ​អ្នក​ប្រាកដ​ឬ​អត់?',
      'delete' => 'តើ​អ្នកចង់លុបទិន្នន័យនេះ​ប្រាកដ​ឬ​អត់?',
      'edit' => 'តើ​អ្នកចង់កែប្រែ :name នេះ​ប្រាកដ​ឬ​អត់?',
      'no_one_percent_tax' => 'តើមានការអនុគ្រោះពន្ធដែរទេ?',
      'share_full' => 'ភាគហ៊ុនពេញ',
      'no_exchange' => 'ពុំទាន់មានអត្រាប្ដូរប្រាក់ឡើយ',
      'exist' => 'ទិន្នន័យនេះមានរួចហើយ',
    ],
    'text' => [
      'status' => 'តើអ្នកចង់ផ្លាស់ប្ដូរស្ថានភាពមែនទេ?',
      'save' => 'តើអ្នកចង់រក្សាទុកមែនទេ?',
      'empty_field' => 'សូមបញ្ចូលទិន្នន័យដែលមានសញ្ញាផ្កាយជាដាច់ខាត',
      'unrevertible' => 'អ្នកនឹងមិនអាចត្រឡប់វាវិញបានទេ!',
    ],
    'button' => [
      'create' => '​បង្កើតថ្មី',
      'recheck' => 'ពិនិត្យឡើងវិញ',
      'submit_next' => 'ស្នើសុំបន្ត',
      'no' => 'មិនយល់ព្រម',
      'yes' => 'យល់ព្រម',
    ],
    'result' => [
      'title' => [
        'save' => 'រក្សាទុកដោយជោគជ័យ',
        'wrong' => 'ពុំត្រឹមត្រូវឡើយ!',
        'success' => 'ជោគជ័យ',
        'error' => 'បរាជោគជ័យ',
        'scan_first' => 'សូមស្គេនមុនសិន',
      ],
      'text' => [
        'submit' => 'ការស្នើសុំត្រូបានដាក់ស្នើដោយជោគជ័យ',
        'resubmit' => 'ការដាក់ឱ្យឆែកមើលឡើងវិញដោយជោគជ័យ',
        'delete' => 'ត្រូវបានលុបចោលដោយជោគជ័យ',
        'save' => 'ត្រូវបានរក្សាទុក',
        'duplicate' => 'ពុំអាចបញ្ចូលលេខវិក្កយបត្រដូចគ្នាក្នុងឆ្នាំតែមួយបានទេ',
        'duplicate1' => 'ទិន្ន័យជាន់គ្នាមិនអាចបញ្ចូលបាន',
        'no_one_percent_tax' => 'ការអនុគ្រោះពន្ធបានបើកដោយជោគជ័យ',
        'scan_first' => 'សូមស្គេនមុនយកទៅជូនអតិថិជន',
      ],
      'button' => [
        'no' => 'មិនយល់ព្រម',
        'yes' => 'យល់ព្រម',
      ],
    ],
  ],

  
  'modal' => [
    'title' => [
			'create_service' => 'បង្កើតសេវាកម្ម',
			'detail' => 'លម្អិត',
			'password_confirm' => 'បញ្ចូលពាក្យសម្ងាត់អ្នក',
			'prescription_detail' => 'វេជ្ជបញ្ជាលម្អិត',
			'invoice_detail' => 'វិក្កយបត្រលម្អិត',
      'labor_detail' => 'ការពិនិត្យឈាមលម្អិត',
			'empty_data' => 'មិនទាន់មានទិន្នន័យ',
			'add_item' => 'បង្កើតវិក្កយបត្រលម្អិត',
			'edit_item' => 'កែប្រែវិក្កយបត្រលម្អិត',
			'add_labor_item' => 'បន្ថែមធាតុនៃការពិនិត្យឈាម',
			'add_prescription_item' => 'បន្ថែមថ្នាំ',
			'edit_prescription_item' => 'កែប្រែថ្នាំ',
    ],
    'form' => [
      'password_confirm' => 'បញ្ចូលពាក្យសម្ងាត់អ្នក',
      'current_password' => 'ពាក្យសម្ងាត់បច្ចុប្បន្ន',
      'new_password' => 'ពាក្យសម្ងាត់ថ្មី',
      'confirm_password' => 'បញ្ជាក់-ពាក្យសម្ងាត់ថ្មី',
    ],
  ]


];
